# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\Laboratorio\Incubadora\2020\Incubadora Refrigerada Peltier Touch DYM 750L #004588424 OP2020354\Firmware Psoc\LCD2\IncubadoraRefrigerada.cydsn\IncubadoraRefrigerada.cyprj
# Date: Fri, 04 Dec 2020 14:08:35 GMT
#set_units -time ns
create_clock -name {ADC_Ext_CP_Clk(routed)} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {ADC_SAR_IntClock(routed)} -period 1000 -waveform {0 500} [list [get_pins {ClockBlock/dclk_1}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_clock -name {ADC_Ext_CP_Clk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {ADC_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 9 19} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_generated_clock -name {ADC_SAR_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 25 49} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {UART_1_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 313 627} [list [get_pins {ClockBlock/dclk_glb_2}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for D:\Laboratorio\Incubadora\2020\Incubadora Refrigerada Peltier Touch DYM 750L #004588424 OP2020354\Firmware Psoc\LCD2\IncubadoraRefrigerada.cydsn\TopDesign\TopDesign.cysch
# Project: D:\Laboratorio\Incubadora\2020\Incubadora Refrigerada Peltier Touch DYM 750L #004588424 OP2020354\Firmware Psoc\LCD2\IncubadoraRefrigerada.cydsn\IncubadoraRefrigerada.cyprj
# Date: Fri, 04 Dec 2020 14:08:22 GMT
